Revit 2027 API
BuiltInFailures.DPartFailures.IneligibleElementsForParts Property
 Creating parts from ineligible elements
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId IneligibleElementsForParts { get; }
Public Shared ReadOnly Property IneligibleElementsForParts As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ IneligibleElementsForParts {
	FailureDefinitionId^ get ();
}
static member IneligibleElementsForParts : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DPartFailures Class
Autodesk.Revit.DB Namespace